InformationRegisters/дп_ПринтерыМакетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>дп_ПринтерыМакетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Принтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.дп_Принтеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолеСверху</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолеСнизу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолеСправа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолеСлева</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаСтраницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШиринаСтраницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Макет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонЭтикетки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЭтикетокИЦенников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/дп_ПринтерыМакетов/Ext/ManagerModule.bsl
Функция ПолучитьПринтерМакета(ИмяМакета, Пользователь) Экспорт
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Результат = Новый Структура("ИмяПринтера,ПолеСверху,ПолеСнизу,ПолеСправа,ПолеСлева,ВысотаСтраницы,ШиринаСтраницы");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	дп_ПринтерыМакетов.Принтер КАК ИмяПринтера,
		|	дп_ПринтерыМакетов.ПолеСверху КАК ПолеСверху,
		|	дп_ПринтерыМакетов.ПолеСнизу КАК ПолеСнизу,
		|	дп_ПринтерыМакетов.ПолеСправа КАК ПолеСправа,
		|	дп_ПринтерыМакетов.ПолеСлева КАК ПолеСлева,
		|	дп_ПринтерыМакетов.ВысотаСтраницы КАК ВысотаСтраницы,
		|	дп_ПринтерыМакетов.ШиринаСтраницы КАК ШиринаСтраницы
		|ИЗ
		|	РегистрСведений.дп_ПринтерыМакетов КАК дп_ПринтерыМакетов
		|ГДЕ
		|	дп_ПринтерыМакетов.Пользователь = &Пользователь
		|	И дп_ПринтерыМакетов.Макет = &Макет";
	
	Запрос.УстановитьПараметр("Макет", ИмяМакета);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, ВыборкаДетальныеЗаписи);
		Возврат Результат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецФункции	

//Кожемякин А.Г. agkozhemyakin@gmail.com {
//31.08.2016 13:24:54
Функция ДополнитьКоллекцияПечатныхФормПринтеры(АдресКоллекцияПечатныхФорм, Пользователь) Экспорт
	КоллекцияПечатныхФорм  = ПолучитьИзВременногоХранилища(АдресКоллекцияПечатныхФорм);
	МассивМакетов = КоллекцияПечатныхФорм.ВыгрузитьКолонку("Представление");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	дп_ПринтерыМакетов.Принтер как Принтер,
		|	дп_ПринтерыМакетов.Макет как Макет
		|ИЗ
		|	РегистрСведений.дп_ПринтерыМакетов КАК дп_ПринтерыМакетов
		|ГДЕ
		|	дп_ПринтерыМакетов.Пользователь = &Пользователь
		|	И дп_ПринтерыМакетов.Макет В (&Макет)";
	
	Запрос.УстановитьПараметр("Макет", МассивМакетов);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий()  Цикл
		НайденнаяСтрока = КоллекцияПечатныхФорм.Найти(ВыборкаДетальныеЗаписи.Макет, "Представление");
		Если Не НайденнаяСтрока = Неопределено Тогда
			НайденнаяСтрока.Принтер = ВыборкаДетальныеЗаписи.Принтер;
   		КонецЕсли;
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(КоллекцияПечатныхФорм, АдресКоллекцияПечатныхФорм);
	Возврат АдресКоллекцияПечатныхФорм;
КонецФункции

Процедура УстановитьПринтерМакета(Макет, Принтер, Пользователь) Экспорт

	МенеджерЗаписи = РегистрыСведений.дп_ПринтерыМакетов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Макет = Макет;
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.Принтер = Принтер;
	МенеджерЗаписи.Записать();

КонецПроцедуры

//}Кожемякин А.Г.
